muvox-io/euphonium/targets/esp32/sdkconfig.defaults
#
# Automatically generated file. DO NOT EDIT.
# Espressif IoT Development Framework (ESP-IDF) Project Configuration
#

# DSP
CONFIG_DSP_OPTIMIZED=y
CONFIG_DSP_OPTIMIZATION=1
CONFIG_DSP_MAX_FFT_SIZE_512=y
CONFIG_IDF_TARGET_ESP32=y
CONFIG_IDF_TARGET="esp32"

#
# SDK tool configuration
#
CONFIG_SDK_TOOLPREFIX="xtensa-esp32-elf-"
CONFIG_SDK_MAKE_WARN_UNDEFINED_VARIABLES=y
CONFIG_APP_COMPILE_TIME_DATE=y



CONFIG_OTA_ALLOW_HTTP=y


CONFIG_BOOTLOADER_LOG_LEVEL_INFO=y


CONFIG_BOOTLOADER_LOG_LEVEL=3
CONFIG_BOOTLOADER_SPI_WP_PIN=7
CONFIG_BOOTLOADER_VDDSDIO_BOOST_1_9V=y


CONFIG_BOOTLOADER_WDT_ENABLE=y

CONFIG_BOOTLOADER_WDT_TIME_MS=9000

CONFIG_ESPTOOLPY_BAUD_2MB=y


CONFIG_ESPTOOLPY_BAUD_OTHER_VAL=115200
CONFIG_ESPTOOLPY_BAUD=2000000
CONFIG_ESPTOOLPY_COMPREED=y
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y



CONFIG_ESPTOOLPY_FLASHMODE="dio"
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y



CONFIG_ESPTOOLPY_FLASHFREQ="80m"


CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y


CONFIG_ESPTOOLPY_FLASHSIZE="4MB"
CONFIG_ESPTOOLPY_FLASHSIZE_DETECT=y
CONFIG_ESPTOOLPY_BEFORE_RESET=y

CONFIG_ESPTOOLPY_BEFORE="default_reset"
CONFIG_ESPTOOLPY_AFTER_RESET=y

CONFIG_ESPTOOLPY_AFTER="hard_reset"


CONFIG_ESPTOOLPY_MONITOR_BAUD_115200B=y




CONFIG_ESPTOOLPY_MONITOR_BAUD_OTHER_VAL=115200
CONFIG_ESPTOOLPY_MONITOR_BAUD=115200


CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_OFFSET=0x8000
CONFIG_PARTITION_TABLE_MD5=y
CONFIG_LOGGING_SLIMPROTO="info"
CONFIG_LOGGING_STREAM="info"
CONFIG_LOGGING_DECODE="info"
CONFIG_LOGGING_OUTPUT="info"
CONFIG_INCLUDE_FLAC=y
CONFIG_INCLUDE_FAAD=y
CONFIG_INCLUDE_MAD=y
CONFIG_INCLUDE_VORBIS=y
CONFIG_INCLUDE_ALAC=y

CONFIG_SQUEEZEAMP=y

CONFIG_A2DP_SINK_NAME="SMSL BT4.2"
CONFIG_A2DP_DEV_NAME="Squeezelite"
CONFIG_A2DP_CONTROL_DELAY_MS=500
CONFIG_A2DP_CONNECT_TIMEOUT_MS=1000
CONFIG_BT_SINK=y
CONFIG_BT_SINK_NAME="ESP32-BT"
CONFIG_BT_SINK_PIN=1234
CONFIG_AIRPLAY_SINK=y
CONFIG_AIRPLAY_NAME="ESP32-AirPlay"
CONFIG_AIRPLAY_PORT="5000"
CONFIG_WIFI_MANAGER_TASK_PRIORITY=5
CONFIG_WIFI_MANAGER_MAX_RETRY=2
CONFIG_DEFAULT_AP_SSID="squeezelite"
CONFIG_DEFAULT_AP_PASSWORD="squeezelite"
CONFIG_DEFAULT_AP_CHANNEL=1
CONFIG_DEFAULT_AP_IP="192.168.4.1"
CONFIG_DEFAULT_AP_GATEWAY="192.168.4.1"
CONFIG_DEFAULT_AP_NETMASK="255.255.255.0"
CONFIG_DEFAULT_AP_MAX_CONNECTIONS=4
CONFIG_DEFAULT_AP_BEACON_INTERVAL=100
CONFIG_DEFAULT_COMMAND_LINE="squeezelite -o I2S -b 500:2000 -d all=info -C 30"

CONFIG_COMPILER_OPTIMIZATION_SIZE=y
CONFIG_COMPILER_OPTIMIZATION_ASSERTIONS_ENABLE=y



CONFIG_COMPILER_STACK_CHECK_MODE_NONE=y







CONFIG_APPTRACE_DEST_NONE=y

CONFIG_APPTRACE_LOCK_ENABLE=y
CONFIG_BT_ENABLED=y

CONFIG_BTDM_CTRL_MODE_BR_EDR_ONLY=y

CONFIG_BTDM_CTRL_BR_EDR_MAX_ACL_CONN=2
CONFIG_BTDM_CTRL_BR_EDR_MAX_SYNC_CONN=0

CONFIG_BTDM_CTRL_BR_EDR_SCO_DATA_PATH_PCM=y
CONFIG_BTDM_CTRL_BR_EDR_SCO_DATA_PATH_EFF=1
CONFIG_BTDM_CTRL_BLE_MAX_CONN_EFF=0
CONFIG_BTDM_CTRL_BR_EDR_MAX_ACL_CONN_EFF=2
CONFIG_BTDM_CTRL_BR_EDR_MAX_SYNC_CONN_EFF=0
CONFIG_BTDM_CTRL_PINNED_TO_CORE_0=y

CONFIG_BTDM_CTRL_PINNED_TO_CORE=0
CONFIG_BTDM_CTRL_HCI_MODE_VHCI=y

CONFIG_BTDM_MODEM_SLEEP=y
CONFIG_BTDM_MODEM_SLEEP_MODE_ORIG=y

CONFIG_BTDM_LPCLK_SEL_MAIN_XTAL=y
CONFIG_BTDM_BLE_SLEEP_CLOCK_ACCURACY_INDEX_EFF=1
CONFIG_BT_BLUEDROID_ENABLED=y

CONFIG_BT_BTC_TASK_STACK_SIZE=3072
CONFIG_BT_BLUEDROID_PINNED_TO_CORE_0=y

CONFIG_BT_BLUEDROID_PINNED_TO_CORE=0
CONFIG_BT_BTU_TASK_STACK_SIZE=4096

CONFIG_BT_CLASSIC_ENABLED=y
CONFIG_BT_A2DP_ENABLE=y
CONFIG_BT_A2DP_SINK_TASK_STACK_SIZE=2048
CONFIG_BT_A2DP_SOURCE_TASK_STACK_SIZE=2048


CONFIG_BT_SSP_ENABLED=y
CONFIG_BT_BLE_ENABLED=n
CONFIG_BT_BLE_SMP_ENABLE=y




CONFIG_BT_LOG_HCI_TRACE_LEVEL_WARNING=y




CONFIG_BT_LOG_HCI_TRACE_LEVEL=2


CONFIG_BT_LOG_BTM_TRACE_LEVEL_WARNING=y




CONFIG_BT_LOG_BTM_TRACE_LEVEL=2


CONFIG_BT_LOG_L2CAP_TRACE_LEVEL_WARNING=y




CONFIG_BT_LOG_L2CAP_TRACE_LEVEL=2


CONFIG_BT_LOG_RFCOMM_TRACE_LEVEL_WARNING=y




CONFIG_BT_LOG_RFCOMM_TRACE_LEVEL=2


CONFIG_BT_LOG_SDP_TRACE_LEVEL_WARNING=y




CONFIG_BT_LOG_SDP_TRACE_LEVEL=2


CONFIG_BT_LOG_GAP_TRACE_LEVEL_WARNING=y




CONFIG_BT_LOG_GAP_TRACE_LEVEL=2


CONFIG_BT_LOG_BNEP_TRACE_LEVEL_WARNING=y




CONFIG_BT_LOG_BNEP_TRACE_LEVEL=2


CONFIG_BT_LOG_PAN_TRACE_LEVEL_WARNING=y




CONFIG_BT_LOG_PAN_TRACE_LEVEL=2


CONFIG_BT_LOG_A2D_TRACE_LEVEL_WARNING=y




CONFIG_BT_LOG_A2D_TRACE_LEVEL=2


CONFIG_BT_LOG_AVDT_TRACE_LEVEL_WARNING=y




CONFIG_BT_LOG_AVDT_TRACE_LEVEL=2


CONFIG_BT_LOG_AVCT_TRACE_LEVEL_WARNING=y




CONFIG_BT_LOG_AVCT_TRACE_LEVEL=2


CONFIG_BT_LOG_AVRC_TRACE_LEVEL_WARNING=y




CONFIG_BT_LOG_AVRC_TRACE_LEVEL=2


CONFIG_BT_LOG_MCA_TRACE_LEVEL_WARNING=y




CONFIG_BT_LOG_MCA_TRACE_LEVEL=2


CONFIG_BT_LOG_HID_TRACE_LEVEL_WARNING=y




CONFIG_BT_LOG_HID_TRACE_LEVEL=2


CONFIG_BT_LOG_APPL_TRACE_LEVEL_WARNING=y




CONFIG_BT_LOG_APPL_TRACE_LEVEL=2


CONFIG_BT_LOG_GATT_TRACE_LEVEL_WARNING=y




CONFIG_BT_LOG_GATT_TRACE_LEVEL=2


CONFIG_BT_LOG_SMP_TRACE_LEVEL_WARNING=y




CONFIG_BT_LOG_SMP_TRACE_LEVEL=2


CONFIG_BT_LOG_BTIF_TRACE_LEVEL_WARNING=y




CONFIG_BT_LOG_BTIF_TRACE_LEVEL=2


CONFIG_BT_LOG_BTC_TRACE_LEVEL_WARNING=y




CONFIG_BT_LOG_BTC_TRACE_LEVEL=2


CONFIG_BT_LOG_OSI_TRACE_LEVEL_WARNING=y




CONFIG_BT_LOG_OSI_TRACE_LEVEL=2


CONFIG_BT_LOG_BLUFI_TRACE_LEVEL_WARNING=y




CONFIG_BT_LOG_BLUFI_TRACE_LEVEL=2
CONFIG_BT_ACL_CONNECTIONS=4



CONFIG_BT_SMP_ENABLE=y
CONFIG_BT_BLE_ESTAB_LINK_CONN_TOUT=30
CONFIG_BT_RESERVE_DRAM=0xdb5c


CONFIG_ADC_DISABLE_DAC=y

CONFIG_SPI_MASTER_ISR_IN_IRAM=y
CONFIG_SPI_SLAVE_ISR_IN_IRAM=y
CONFIG_SPI_MASTER_IN_IRAM=y
CONFIG_SPI_SLAVE_IN_IRAM=y


CONFIG_EFUSE_CODE_SCHEME_COMPAT_3_4=y

CONFIG_EFUSE_MAX_BLK_LEN=192



CONFIG_ESP32_DEFAULT_CPU_FREQ_240=y
CONFIG_ESP32_DEFAULT_CPU_FREQ_MHZ=240
CONFIG_ESP32_SPIRAM_SUPPORT=y
CONFIG_SPIRAM_BOOT_INIT=y


CONFIG_SPIRAM_USE_MALLOC=y
CONFIG_SPIRAM_TYPE_AUTO=y


CONFIG_SPIRAM_SIZE=-1

CONFIG_SPIRAM_SPEED_80M=y
CONFIG_SPIRAM_MEMTEST=y
CONFIG_SPIRAM_CACHE_WORKAROUND=y

CONFIG_SPIRAM_MALLOC_ALWAYSINTERNAL=256
CONFIG_SPIRAM_MALLOC_RESERVE_INTERNAL=65536
CONFIG_SPIRAM_ALLOW_BSS_SEG_EXTERNAL_MEMORY=y
CONFIG_SPIRAM_ALLOW_STACK_EXTERNAL_MEMORY=y


CONFIG_SPIRAM_OCCUPY_VSPI_HOST=y
CONFIG_D0WD_PSRAM_CLK_IO=17
CONFIG_D0WD_PSRAM_CS_IO=16
CONFIG_D2WD_PSRAM_CLK_IO=9
CONFIG_D2WD_PSRAM_CS_IO=10
CONFIG_PICO_PSRAM_CS_IO=10



