muvox-io/euphonium/targets/esp32/sdkconfig.defaults
CONFIG_MBEDTLS_RC4_DISABLED=y




CONFIG_MBEDTLS_CCM_C=y
CONFIG_MBEDTLS_GCM_C=y

CONFIG_MBEDTLS_PEM_PARSE_C=y
CONFIG_MBEDTLS_PEM_WRITE_C=y
CONFIG_MBEDTLS_X509_CRL_PARSE_C=y
CONFIG_MBEDTLS_X509_CSR_PARSE_C=y
CONFIG_MBEDTLS_ECP_C=y
CONFIG_MBEDTLS_ECDH_C=y
CONFIG_MBEDTLS_ECDSA_C=y
CONFIG_MBEDTLS_ECP_DP_SECP192R1_ENABLED=y
CONFIG_MBEDTLS_ECP_DP_SECP224R1_ENABLED=y
CONFIG_MBEDTLS_ECP_DP_SECP256R1_ENABLED=y
CONFIG_MBEDTLS_ECP_DP_SECP384R1_ENABLED=y
CONFIG_MBEDTLS_ECP_DP_SECP521R1_ENABLED=y
CONFIG_MBEDTLS_ECP_DP_SECP192K1_ENABLED=y
CONFIG_MBEDTLS_ECP_DP_SECP224K1_ENABLED=y
CONFIG_MBEDTLS_ECP_DP_SECP256K1_ENABLED=y
CONFIG_MBEDTLS_ECP_DP_BP256R1_ENABLED=y
CONFIG_MBEDTLS_ECP_DP_BP384R1_ENABLED=y
CONFIG_MBEDTLS_ECP_DP_BP512R1_ENABLED=y
CONFIG_MBEDTLS_ECP_DP_CURVE25519_ENABLED=y
CONFIG_MBEDTLS_ECP_NIST_OPTIM=y
CONFIG_MDNS_MAX_SERVICES=10
CONFIG_MQTT_PROTOCOL_311=y
CONFIG_MQTT_TRANSPORT_SSL=y
CONFIG_MQTT_TRANSPORT_WEBSOCKET=y
CONFIG_MQTT_TRANSPORT_WEBSOCKET_SECURE=y



CONFIG_NEWLIB_STDOUT_LINE_ENDING_CRLF=y




CONFIG_NEWLIB_STDIN_LINE_ENDING_CR=y


CONFIG_OPENSSL_ASSERT_DO_NOTHING=y

CONFIG_PTHREAD_TASK_PRIO_DEFAULT=5
CONFIG_PTHREAD_TASK_STACK_SIZE_DEFAULT=3072
CONFIG_PTHREAD_STACK_MIN=768


CONFIG_PTHREAD_DEFAULT_CORE_1=y
CONFIG_PTHREAD_TASK_CORE_DEFAULT=1
CONFIG_PTHREAD_TASK_NAME_DEFAULT="pthread"


CONFIG_SPI_FLASH_ROM_DRIVER_PATCH=y
CONFIG_SPI_FLASH_DANGEROUS_WRITE_ABORTS=y



CONFIG_SPI_FLASH_SUPPORT_ISSI_CHIP=y
CONFIG_SPIFFS_MAX_PARTITIONS=3
CONFIG_SPIFFS_CACHE=y
CONFIG_SPIFFS_CACHE_WR=y

CONFIG_SPIFFS_PAGE_CHECK=y
CONFIG_SPIFFS_GC_MAX_RUNS=10

CONFIG_SPIFFS_PAGE_SIZE=256
CONFIG_SPIFFS_OBJ_NAME_LEN=32
CONFIG_SPIFFS_USE_MAGIC=y
CONFIG_SPIFFS_USE_MAGIC_LENGTH=y
CONFIG_SPIFFS_META_LENGTH=4
CONFIG_SPIFFS_USE_MTIME=y






CONFIG_NETIF_IP_LOST_TIMER_INTERVAL=120
CONFIG_TCPIP_LWIP=y
CONFIG_UNITY_ENABLE_FLOAT=y
CONFIG_UNITY_ENABLE_DOUBLE=y

CONFIG_UNITY_ENABLE_IDF_TEST_RUNNER=y


CONFIG_VFS_SUPPRESS_SELECT_DEBUG_OUTPUT=y
CONFIG_VFS_SUPPORT_TERMIOS=y
CONFIG_SEMIHOSTFS_MAX_MOUNT_POINTS=1
CONFIG_SEMIHOSTFS_HOST_PATH_MAX_LEN=128

CONFIG_WL_SECTOR_SIZE_512=y
#CONFIG_WL_SECTOR_SIZE_4096 is not defined
CONFIG_WL_SECTOR_SIZE=512
CONFIG_WIFI_PROV_SCAN_MAX_ENTRIES=16



# Deprecated options for backward compatibility
CONFIG_TOOLPREFIX="xtensa-esp32-elf-"
CONFIG_MAKE_WARN_UNDEFINED_VARIABLES=y



CONFIG_LOG_BOOTLOADER_LEVEL_INFO=y


CONFIG_LOG_BOOTLOADER_LEVEL=3


CONFIG_FLASHMODE_QIO=y





CONFIG_MONITOR_BAUD_115200B=y




CONFIG_MONITOR_BAUD_OTHER_VAL=115200
CONFIG_MONITOR_BAUD=115200

CONFIG_OPTIMIZATION_LEVEL_RELEASE=y
CONFIG_OPTIMIZATION_ASSERTIONS_ENABLED=y



CONFIG_STACK_CHECK_NONE=y







CONFIG_BTDM_CONTROLLER_MODE_BR_EDR_ONLY=y

CONFIG_BTDM_CONTROLLER_BR_EDR_MAX_ACL_CONN=2
CONFIG_BTDM_CONTROLLER_BR_EDR_MAX_SYNC_CONN=0
CONFIG_BTDM_CONTROLLER_BLE_MAX_CONN_EFF=0
CONFIG_BTDM_CONTROLLER_BR_EDR_MAX_ACL_CONN_EFF=2
CONFIG_BTDM_CONTROLLER_BR_EDR_MAX_SYNC_CONN_EFF=0
CONFIG_BTDM_CONTROLLER_PINNED_TO_CORE=0
CONFIG_BTDM_CONTROLLER_HCI_MODE_VHCI=y

CONFIG_BTDM_CONTROLLER_MODEM_SLEEP=y
CONFIG_BLUEDROID_ENABLED=y
CONFIG_BTC_TASK_STACK_SIZE=3072
CONFIG_BLUEDROID_PINNED_TO_CORE_0=y

CONFIG_BLUEDROID_PINNED_TO_CORE=0
CONFIG_BTU_TASK_STACK_SIZE=4096

CONFIG_CLASSIC_BT_ENABLED=y
CONFIG_A2DP_ENABLE=y
CONFIG_A2DP_SINK_TASK_STACK_SIZE=2048
CONFIG_A2DP_SOURCE_TASK_STACK_SIZE=2048

CONFIG_GATTS_ENABLE=y

CONFIG_GATTS_SEND_SERVICE_CHANGE_AUTO=y
CONFIG_GATTS_SEND_SERVICE_CHANGE_MODE=0
CONFIG_GATTC_ENABLE=y

CONFIG_BLE_SMP_ENABLE=y



CONFIG_HCI_TRACE_LEVEL_WARNING=y




CONFIG_HCI_INITIAL_TRACE_LEVEL=2


CONFIG_BTM_TRACE_LEVEL_WARNING=y




CONFIG_BTM_INITIAL_TRACE_LEVEL=2


CONFIG_L2CAP_TRACE_LEVEL_WARNING=y




CONFIG_L2CAP_INITIAL_TRACE_LEVEL=2


CONFIG_RFCOMM_TRACE_LEVEL_WARNING=y




CONFIG_RFCOMM_INITIAL_TRACE_LEVEL=2


CONFIG_SDP_TRACE_LEVEL_WARNING=y




CONFIG_BTH_LOG_SDP_INITIAL_TRACE_LEVEL=2


CONFIG_GAP_TRACE_LEVEL_WARNING=y




CONFIG_GAP_INITIAL_TRACE_LEVEL=2
CONFIG_BNEP_INITIAL_TRACE_LEVEL=2


CONFIG_PAN_TRACE_LEVEL_WARNING=y




CONFIG_PAN_INITIAL_TRACE_LEVEL=2


CONFIG_A2D_TRACE_LEVEL_WARNING=y




CONFIG_A2D_INITIAL_TRACE_LEVEL=2


CONFIG_AVDT_TRACE_LEVEL_WARNING=y




CONFIG_AVDT_INITIAL_TRACE_LEVEL=2


CONFIG_AVCT_TRACE_LEVEL_WARNING=y




CONFIG_AVCT_INITIAL_TRACE_LEVEL=2


CONFIG_AVRC_TRACE_LEVEL_WARNING=y




CONFIG_AVRC_INITIAL_TRACE_LEVEL=2


CONFIG_MCA_TRACE_LEVEL_WARNING=y




CONFIG_MCA_INITIAL_TRACE_LEVEL=2


CONFIG_HID_TRACE_LEVEL_WARNING=y




CONFIG_HID_INITIAL_TRACE_LEVEL=2


CONFIG_APPL_TRACE_LEVEL_WARNING=y




CONFIG_APPL_INITIAL_TRACE_LEVEL=2


CONFIG_GATT_TRACE_LEVEL_WARNING=y




CONFIG_GATT_INITIAL_TRACE_LEVEL=2


CONFIG_SMP_TRACE_LEVEL_WARNING=y




CONFIG_SMP_INITIAL_TRACE_LEVEL=2


CONFIG_BTIF_TRACE_LEVEL_WARNING=y




CONFIG_BTIF_INITIAL_TRACE_LEVEL=2


CONFIG_BTC_TRACE_LEVEL_WARNING=y




CONFIG_BTC_INITIAL_TRACE_LEVEL=2


CONFIG_OSI_TRACE_LEVEL_WARNING=y




CONFIG_OSI_INITIAL_TRACE_LEVEL=2


CONFIG_BLUFI_TRACE_LEVEL_WARNING=y




CONFIG_BLUFI_INITIAL_TRACE_LEVEL=2

CONFIG_SMP_ENABLE=y
CONFIG_BLE_ESTABLISH_LINK_CONNECTION_TIMEOUT=30
CONFIG_ADC2_DISABLE_DAC=y
CONFIG_SPIRAM_SUPPORT=y



CONFIG_TRACEMEM_RESERVE_DRAM=0x0

CONFIG_FOUR_UNIVERSAL_MAC_ADDRESS=y
CONFIG_NUMBER_OF_UNIVERSAL_MAC_ADDRESS=4

CONFIG_ULP_COPROC_RESERVE_MEM=0
CONFIG_BROWNOUT_DET=y
CONFIG_BROWNOUT_DET_LVL_SEL_0=y







CONFIG_BROWNOUT_DET_LVL=0
CONFIG_REDUCE_PHY_TX_POWER=y
CONFIG_ESP32_RTC_CLOCK_SOURCE_INTERNAL_RC=y





CONFIG_SYSTEM_EVENT_QUEUE_SIZE=32
CONFIG_SYSTEM_EVENT_TASK_STACK_SIZE=2304
CONFIG_MAIN_TASK_STACK_SIZE=8192
CONFIG_IPC_TASK_STACK_SIZE=1024
CONFIG_TIMER_TASK_STACK_SIZE=3584
CONFIG_CONSOLE_UART_DEFAULT=y


CONFIG_CONSOLE_UART_NUM=0
CONFIG_CONSOLE_UART_BAUDRATE=115200
CONFIG_INT_WDT=y
CONFIG_INT_WDT_TIMEOUT_MS=800
CONFIG_INT_WDT_CHECK_CPU1=y
CONFIG_TASK_WDT=y

CONFIG_TASK_WDT_TIMEOUT_S=5
CONFIG_TASK_WDT_CHECK_IDLE_TASK_CPU0=y
CONFIG_TASK_WDT_CHECK_IDLE_TASK_CPU1=y

CONFIG_POST_EVENTS_FROM_ISR=y
CONFIG_POST_EVENTS_FROM_IRAM_ISR=y
CONFIG_SW_COEXIST_ENABLE=y


CONFIG_SW_COEXIST_PREFERENCE_BALANCE=y
CONFIG_SW_COEXIST_PREFERENCE_VALUE=2
CONFIG_MB_MASTER_TIMEOUT_MS_RESPOND=150
CONFIG_MB_MASTER_DELAY_MS_CONVERT=200
CONFIG_MB_QUEUE_LENGTH=20
CONFIG_MB_SERIAL_TASK_STACK_SIZE=2048
CONFIG_MB_SERIAL_BUF_SIZE=256
CONFIG_MB_SERIAL_TASK_PRIO=10

CONFIG_MB_CONTROLLER_NOTIFY_TIMEOUT=20
CONFIG_MB_CONTROLLER_NOTIFY_QUEUE_SIZE=20
CONFIG_MB_CONTROLLER_STACK_SIZE=4096
CONFIG_MB_EVENT_QUEUE_TIMEOUT=20
CONFIG_MB_TIMER_PORT_ENABLED=y
CONFIG_MB_TIMER_GROUP=0
CONFIG_MB_TIMER_INDEX=0
CONFIG_SUPPORT_STATIC_ALLOCATION=y

CONFIG_TIMER_TASK_PRIORITY=1
CONFIG_TIMER_TASK_STACK_DEPTH=2048
CONFIG_TIMER_QUEUE_LENGTH=10


CONFIG_ESP_GRATUITOUS_ARP=y
CONFIG_GARP_TMR_INTERVAL=60
CONFIG_TCPIP_RECVMBOX_SIZE=32
CONFIG_TCP_MAXRTX=12
CONFIG_TCP_SYNMAXRTX=6
CONFIG_TCP_MSS=1440
CONFIG_TCP_MSL=60000
CONFIG_TCP_SND_BUF_DEFAULT=8192
CONFIG_TCP_WND_DEFAULT=32768
CONFIG_TCP_RECVMBOX_SIZE=32
CONFIG_TCP_QUEUE_OOSEQ=y

CONFIG_TCP_OVERSIZE_MSS=y


CONFIG_UDP_RECVMBOX_SIZE=32
CONFIG_TCPIP_TASK_STACK_SIZE=3072
CONFIG_TCPIP_TASK_AFFINITY_NO_AFFINITY=y


CONFIG_TCPIP_TASK_AFFINITY=0x7FFFFFFF

CONFIG_PTHREAD_STACK_MIN=768
CONFIG_SPI_FLASH_WRITING_DANGEROUS_REGIONS_ABORTS=y


CONFIG_IP_LOST_TIMER_INTERVAL=120
CONFIG_SUPPRESS_SELECT_DEBUG_OUTPUT=y
CONFIG_SUPPORT_TERMIOS=y
# End of deprecated optionsS
S
